In [21]:


import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [3]:
# convert lowercase column use str.lower()
df['Courses'] = df['Courses'].str.lower()
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

In [4]:
# convert lowercase column use apply()
df['Courses'] = df['Courses'].apply(str.lower)
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

In [5]:
# Use apply() & lambda function
df['Courses'].apply(lambda x: x.lower())
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

In [6]:
# Convert pandas column to lowercase use map()
df['Courses'] = df['Courses'].map(str.lower)
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

In [7]:
df['Courses'] = df['Courses'].str.upper()
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [8]:
df['Courses'] = df['Courses'].apply(str.upper)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [9]:
df['Courses'].apply(lambda x: x.upper())
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [10]:
df['Courses'] = df['Courses'].map(str.upper)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [3]:
df['Courses'] = df['Courses'].str.len()
df

   Courses    Fee Duration Discount
0        5  22000   30days     1000
1        7  25000   50days     2300
2        6  24000   40days     2500
3        6  26000   60days     1400

In [6]:
df['Courses'] = df['Courses'].str.strip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [7]:
df['Courses'] = df['Courses'].str.lstrip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [8]:
df['Courses'] = df['Courses'].str.rstrip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

In [9]:
df['Courses'] = df['Courses'].str.split()
df

     Courses    Fee Duration Discount
0    [SPARK]  22000   30days     1000
1  [PYSPARK]  25000   50days     2300
2   [HADOOP]  24000   40days     2500
3   [PANDAS]  26000   60days     1400

In [10]:
df['Courses'] = df['Courses'].str.contains('PA')
df

   Courses    Fee Duration Discount
0      NaN  22000   30days     1000
1      NaN  25000   50days     2300
2      NaN  24000   40days     2500
3      NaN  26000   60days     1400

In [13]:
df['Courses'] = df['Courses'].str.replace('HADOOP' , 'VANSH')
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2    VANSH  24000   40days     2500
3   PANDAS  26000   60days     1400

In [14]:
df['Courses'] = df['Courses'].str.startswith('S')
df

   Courses    Fee Duration Discount
0     True  22000   30days     1000
1    False  25000   50days     2300
2    False  24000   40days     2500
3    False  26000   60days     1400

In [17]:
df['Courses'] = df['Courses'].str.endswith('OP')
df

   Courses    Fee Duration Discount
0    False  22000   30days     1000
1    False  25000   50days     2300
2     True  24000   40days     2500
3    False  26000   60days     1400

In [20]:
df['Courses'] = df['Courses'].str.cat(df['Discount'], sep="-")
df

        Courses    Fee Duration Discount
0    SPARK-1000  22000   30days     1000
1  PYSPARK-2300  25000   50days     2300
2   HADOOP-2500  24000   40days     2500
3   PANDAS-1400  26000   60days     1400

In [22]:
df['Courses'] = df['Courses'].str.get(0)
df

  Courses    Fee Duration Discount
0       S  22000   30days     1000
1       P  25000   50days     2300
2       H  24000   40days     2500
3       P  26000   60days     1400

In [23]:
df['Courses'] = df['Courses'].str.slice(stop=3)
df

  Courses    Fee Duration Discount
0       S  22000   30days     1000
1       P  25000   50days     2300
2       H  24000   40days     2500
3       P  26000   60days     1400

In [24]:
df['Courses'] = df['Courses'].str.find('PARK')
df

   Courses    Fee Duration Discount
0       -1  22000   30days     1000
1       -1  25000   50days     2300
2       -1  24000   40days     2500
3       -1  26000   60days     1400